/******************************************************************************
 Copyright (C), CETE38
 文件名  :    TCPRemoteComm.h
 作者    :    黄光红
 版本    :    v0.0.1
 完成日期:    2013-03-01
 描述    :    TCPRemoteComm.h定义TCPRemoteComm类，
 描述以太网TCP远程通信接口。
 其它    :
 历史记录:

 ...
 ******************************************************************************/

#ifndef TCP_REMOTE_COMM_H
#define TCP_REMOTE_COMM_H

#include "IRemoteComm.h"


#ifdef DSP_WIN32
#include <winsock2.h>
#pragma comment(lib,"ws2_32.lib")
#else
#include <sys/socket.h>
#include <arpa/inet.h>
#endif

#include <string>

using namespace std;


/******************************************************************************
 类名    :    TCPRemoteComm
 描述    :    TCPRemoteComm定义以太网TCP远程通信接口。
 其它    :
 ******************************************************************************/
class TCPRemoteComm :public IRemoteComm
 {
private:
    //物理通信通道类型

    //调试服务端的端口号
    unsigned short ipPort;

    //调试服务端的IP地址
    string ipAddress;

    //socket套接字
    int tcpSockServer;
    int tcpSockAccept;

//构造、析构函数
public:
    /******************************************************************************
     函数名称:    TCPRemoteComm
     描述    :    构造函数
     输入参数:    无
     输出参数:    无
     返回值  :    无
     其它    :
     ******************************************************************************/
    TCPRemoteComm();

    /******************************************************************************
     函数名称:    TCPRemoteComm
     描述    :    析构函数
     输入参数:    无
     输出参数:    无
     返回值  :    无
     其它    :
     ******************************************************************************/
    virtual ~TCPRemoteComm();

public:
    /******************************************************************************
    *函数名称:    setCommProt
    *描述    :     设置远程通信端口号。
    *输入参数:    port指定端口号
    *输出参数:    无
    *返回值  :    无
    *其它    :     远程通信为TCP时，需要调用此函数设置套接字端口号；
    *其它                     远程通信为USB时，需要调用此函数设置USB端口号
    ******************************************************************************/
    virtual void setCommPort(unsigned short port);

    /******************************************************************************
    *函数名称:    setCommAddress
    *描述    :      设置远程通信IP地址
    *输入参数:     address指定远程通信IP地址，形式为“a.b.c.d”
    *输出参数:     无
    *返回值  :      成功返回0；若指定IP地址形式不合法，返回非0错误码ETHERNET_IPADDRESS_INVALID_ERROR
    *其它    :       远程通信为TCP时，需要调用此函数设置IP地址；
    *其它                         远程通信为USB时，不需要调用此函数
    ******************************************************************************/
    virtual int setCommAddress(string address);

    /******************************************************************************
     函数名称:    initClientComm
     描述    :    初始化客户端通信模块
     输入参数:    无
     输出参数:    无
     返回值  :    成功返回0；失败返回非0错误码SERVER_ETHERNET_STARTUP_ERROR
     其它    :
     ******************************************************************************/
    int initComm();

    /******************************************************************************
     函数名称:    closeConnect
     描述    :    关闭连接
     输入参数:    无
     输出参数:    无
     返回值  :    空
     其它    :
     ******************************************************************************/
    void closeConnect();

    /******************************************************************************
             函数名称:    receive
             描述    :    接收数据。接收到指定数量的字节才返回
             输入参数:    bufferCnt指定接收字节数量；
             buffer指定接收缓冲区
             输出参数:    无
             返回值  :    成功返回0；失败返回非0错误码SERVER_ETHERNET_RECV_ERROR
             其它    :
        ******************************************************************************/
    int receive(char *buffer ,int bufferCnt);

    /******************************************************************************
       函数名称:    sendout
       描述    :    发送数据。将指定数量的字节全部发送完成才返回
       输入参数:    bufferCnt指定接收缓冲区字节大小；
                    buffer指定接收缓冲区
       输出参数:    无
       返回值  :    成功返回0；失败返回非0错误码
       其它    :
    ******************************************************************************/
    int sendout(char *buffer ,int bufferCnt);

};
//End class TCPRemoteComm define

#endif//TCP_REMOTE_COMM_H

